function traveling(input){
//     Ани обича да пътува и иска тази година да посети няколко различни дестинации. Като си избере дестинация, 
//ще прецени колко пари ще й трябват, за да отиде до там и ще започне да спестява. Когато е спестила достатъчно, ще може да пътува.
// Функцията получава масив, като всеки път ще се четат първо дестинацията и минималния бюджет, който ще е нужен за пътуването. 
// След това ще се четат няколко суми, които Ани спестява като работи и когато успее да събере достатъчно за пътуването,
// ще заминава, като на конзолата трябва да се изпише:
//  "Going to {дестинацията}!" 
// Когато е посетила всички дестинации, които иска, вместо дестинация ще въведе "End" и програмата ще приключи.
let command;
let index =0;
while((command= input[index]) !== 'End'){
    index++;
    let destination = command;
    let budget = Number(input[index]);
    index++;
    while (budget >0) {
        let moneySave = Number(input[index]);
        index++;
        budget-= moneySave;
    }
    console.log(`Going to ${destination}!`);
}
}
