// •	Предпазен найлон - 1.50 лв. за кв. метър
// •	Боя - 14.50 лв. за литър
// •	Разредител за боя - 5.00 лв. за литър
// За всеки случай, към необходимите материали, Румен иска да добави още 10% от количеството боя и 2 кв.м. найлон, разбира се и 0.40 лв. за торбички. Сумата, която се заплаща на майсторите за 1 час работа, е равна на 30% от сбора на всички разходи за материали.
// Вход
// Входът се чете от конзолата и съдържа точно 4 реда:
// 1.	Необходимо количество найлон (в кв.м.) - цяло число в интервала [1... 100]
// 2.	Необходимо количество боя (в литри) - цяло число в интервала [1…100]
// 3.	Количество разредител (в литри) - цяло число в интервала [1…30]
// 4.	Часовете, за които майсторите ще свършат работата - цяло число в интервала [1…9]
function repair(input){
    let nylon = Number(input[0])+2;
    nylon*=1.5;
    let paint =Number (input[1])*1.1;
    paint *= 14.50;
    let razred =Number(input[2])*5;
    let bag = 0.4;
    let hours =Number(input[3]);
    let sumMaterial = nylon+paint+razred+bag;
    let priceForHours = sumMaterial*0.3;
    let sumWork = hours*priceForHours;
    let total = sumMaterial+sumWork;
    console.log(total)
}
repair(["10 ","11 ","4 ","8 "]);
