// •	Пилешко меню –  10.35 лв. 
// •	Меню с риба – 12.40 лв. 
// •	Вегетарианско меню  – 8.15 лв. 
// Напишете програма, която изчислява колко ще струва на група хора да си поръчат храна за вкъщи.
// Групата ще си поръча и десерт, чиято цена е равна на 20% от общата сметка (без доставката). 
// Цената на доставка е 2.50 лв и се начислява най-накрая.  
// Вход
// От конзолата се четат 3 реда:
// •	Брой пилешки менюта – цяло число в интервала [0 … 99]
// •	Брой менюта с риба – цяло число в интервала [0 … 99]
// •	Брой вегетариански менюта – цяло число в интервала [0 … 99]
function food(input){
    let chiken = Number(input[0])*10.35;
    let fish = Number(input[1])*12.40;
    let vegan = Number(input[2])*8.15;
    let desert = (chiken+fish+vegan)*0.2;
    let total = chiken+fish+vegan+desert+2.50;
    console.log(total);
}
food(["2 ","4 ","3 "])